leaflet/map_01/org/map_01.html
<!doctype html>
<html lang="ru">
<head>
<title>Leaflet — map 01</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Leaflet — map 01</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Введение</h2>
<div class="outline-text-2" id="text-1">
<p>
Пример разработки веб-карт на основе бибилиотеки <a href="https://leafletjs.com/">Leaflet</a> с помощью <a href="https://www.gnu.org/software/emacs/">emacs</a> и <a href="https://orgmode.org/">orgmode</a> в стиле <a href="http://www.literateprogramming.com/">literate programming</a>.
</p>

<p>
<a href="./map_01.org">Исходный код данной страницы</a> и <a href="../index.html">результат</a>. 
</p>

<p>
Экспорт исходников в файл настройки горячей клавишей <code>C-c C-v C-t</code>.
</p>

<p>
Leaflet это библиотека на языке JavaScript с открытым исходным кодом, предназначена для разработки современных интерактивных карт с поддержкой мобильных устройств. Карта помещается в <code>div</code> элемент html5-документа. Таким образом, минимальная веб-карта на Leaflet состоит из:
</p>

<ul class="org-ul">
<li>разметки страницы (html);
</li>
<li>таблицы стилей (css);
</li>
<li>веб-карты (приложения на JavaScript).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Базовый HTML-документ</h2>
<div class="outline-text-2" id="text-2">
<p>
Начнем написание файла <code>index.html</code>, именно этот файл в первую очередь открывает браузер.
</p>

<div class="org-src-container">

<pre class="src src-html"><span style="color: #CC9393;">&lt;!DOCTYPE html&gt;</span>
&lt;<span style="color: #93E0E3;">html</span> <span style="color: #DFAF8F;">lang</span>=<span style="color: #CC9393;">"ru"</span>&gt;

&lt;<span style="color: #93E0E3;">head</span>&gt;
  &lt;<span style="color: #93E0E3;">meta</span> <span style="color: #DFAF8F;">charset</span>=<span style="color: #CC9393;">"utf-8"</span>&gt;
  &lt;<span style="color: #93E0E3;">meta</span> <span style="color: #DFAF8F;">name</span>=<span style="color: #CC9393;">"viewport"</span> <span style="color: #DFAF8F;">content</span>=<span style="color: #CC9393;">"width=device-width, initial-scale=1.0"</span>&gt;
  &lt;<span style="color: #93E0E3;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Leaflet &#8212; map 01</span>&lt;/<span style="color: #93E0E3;">title</span>&gt;
</pre>
</div>

<p>
Добавим ссылку на нашу таблицу стилей.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #93E0E3;">link</span> <span style="color: #DFAF8F;">rel</span>=<span style="color: #CC9393;">"stylesheet"</span> <span style="color: #DFAF8F;">href</span>=<span style="color: #CC9393;">"./styles.css"</span>&gt;
</pre>
</div>

<p>
А также ссылки на таблицу стилей и код библиотеки Leaflet.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #93E0E3;">link</span> <span style="color: #DFAF8F;">rel</span>=<span style="color: #CC9393;">"stylesheet"</span> <span style="color: #DFAF8F;">href</span>=<span style="color: #CC9393;">"https://unpkg.com/leaflet@1.7.1/dist/leaflet.css"</span> <span style="color: #DFAF8F;">integrity</span>=<span style="color: #CC9393;">"sha512-xodZBNTC5n17Xt2atTPuE1HxjVMSvLVW9ocqUKLsCC5CXdbqCmblAshOMAS6/keqq/sMZMZ19scR4PsZChSR7A=="</span> <span style="color: #DFAF8F;">crossorigin</span>=<span style="color: #CC9393;">""</span>/&gt;
&lt;<span style="color: #93E0E3;">script</span> <span style="color: #DFAF8F;">src</span>=<span style="color: #CC9393;">"https://unpkg.com/leaflet@1.7.1/dist/leaflet.js"</span> <span style="color: #DFAF8F;">integrity</span>=<span style="color: #CC9393;">"sha512-XQoYMqMTK8LvdxXYG3nZ448hOEQiglfqkJs1NOQV44cWnUrBc8PkAOcXy20w0vlaXaVUearIOBhiXZ5V3ynxwA=="</span> <span style="color: #DFAF8F;">crossorigin</span>=<span style="color: #CC9393;">""</span>&gt;&lt;/<span style="color: #93E0E3;">script</span>&gt;
</pre>
</div>

<p>
И в завершение настройки базового файла надо в тело документа добавить блок <code>div</code> с картой.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;/<span style="color: #93E0E3;">head</span>&gt;

&lt;<span style="color: #93E0E3;">body</span>&gt;
  &lt;<span style="color: #93E0E3;">div</span> <span style="color: #DFAF8F;">id</span>=<span style="color: #CC9393;">"mapid"</span>&gt;&lt;/<span style="color: #93E0E3;">div</span>&gt;
</pre>
</div>

<p>
А после блока можно добавлять ссылку на исходный код нашей веб-карты.
</p>

<div class="org-src-container">

<pre class="src src-html">  &lt;<span style="color: #93E0E3;">script</span> <span style="color: #DFAF8F;">src</span>=<span style="color: #CC9393;">"./map.js"</span>&gt;&lt;/<span style="color: #93E0E3;">script</span>&gt;
&lt;/<span style="color: #93E0E3;">body</span>&gt;

&lt;/<span style="color: #93E0E3;">html</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Таблица стилей</h2>
<div class="outline-text-2" id="text-3">
<p>
Таблица стилей будет вынесена в отдельный файл для большей практичности.
</p>

<p>
Сейчас основная задача — убрать поля и полосы прокрутки, которые возникнут и будт мешать восприятию, если ничего не предпринять.
</p>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #93E0E3;">body,</span>
<span style="color: #93E0E3;">html </span>{
        <span style="color: #F0DFAF; font-weight: bold;">margin</span>: auto 0;
        <span style="color: #F0DFAF; font-weight: bold;">width</span>: 100%;
        <span style="color: #F0DFAF; font-weight: bold;">height</span>: 100%;
}

<span style="color: #93E0E3;">#mapid </span>{
        <span style="color: #F0DFAF; font-weight: bold;">width</span>: 100%;
        <span style="color: #F0DFAF; font-weight: bold;">height</span>: 100%;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Веб-карта</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">mymap</span> = L.map(<span style="color: #CC9393;">'mapid'</span>).setView([56.03, 92.9], 12);
<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">mymap.options.crs = L.CRS.EPSG3395;</span>

<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">L.tileLayer('http://vec01.maps.yandex.net/tiles?l=map&amp;x={x}&amp;y={y}&amp;z={z}', {</span>
<span style="color: #5F7F5F;">//     </span><span style="color: #7F9F7F;">opacity: 1.0,</span>
<span style="color: #5F7F5F;">//     </span><span style="color: #7F9F7F;">attribution: '',</span>
<span style="color: #5F7F5F;">//     </span><span style="color: #7F9F7F;">minZoom: 1,</span>
<span style="color: #5F7F5F;">//     </span><span style="color: #7F9F7F;">maxZoom: 28,</span>
<span style="color: #5F7F5F;">//     </span><span style="color: #7F9F7F;">minNativeZoom: 0,</span>
<span style="color: #5F7F5F;">//     </span><span style="color: #7F9F7F;">maxNativeZoom: 18</span>
<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">}).addTo(mymap);  </span>

L.tileLayer(<span style="color: #CC9393;">'http://tile.openstreetmap.org/{z}/{x}/{y}.png'</span>, {
    opacity: 1.0,
    attribution: <span style="color: #CC9393;">'&lt;a href="https://www.openstreetmap.org/copyright"&gt;&#169; OpenStreetMap contributors, CC-BY-SA&lt;/a&gt;'</span>,
    minZoom: 1,
    maxZoom: 28,
    minNativeZoom: 0,
    maxNativeZoom: 19
}).addTo(mymap);

</pre>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">Введение</a></li>
<li><a href="#sec-2">Базовый HTML-документ</a></li>
<li><a href="#sec-3">Таблица стилей</a></li>
<li><a href="#sec-4">Веб-карта</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div></div>
</footer>
</body>
</html>
